Tekla.Structures.Model.DeformingData
The DeformingData class holds information about the deforming of parts.
Deformed parts are parts that have been warped, cambered or shortened.
The following example inserts a deformed beam:
using Tekla.Structures.Model;
public class Example
{
public void Example1()
{
Beam MyBeam = new Beam();
MyBeam.DeformingData.Angle = 0.0;
MyBeam.DeformingData.Angle2 = 45.00;
MyBeam.DeformingData.Cambering = 10.0;
MyBeam.DeformingData.Shortening = 20.0;
MyBeam.Insert();
}
}

Tekla.Structures.Model.DeformingData.Angle
The angle of the part at its start point, relative to the part reference line.
For example, if the beam is warped 45 degrees at the end point, in the Angle field the value is 0,
and the value is 45 in the Angle2 field.

Tekla.Structures.Model.DeformingData.Angle2
The angle of the part at its end point, relative to the part reference line.
For example, if the beam is warped 45 degrees at the end point, in the Angle field the value is 0,
and the value is 45 in the Angle2 field.

Tekla.Structures.Model.DeformingData.Cambering
The degree of cambering.

Tekla.Structures.Model.DeformingData.Shortening
The degree of shortening.

Tekla.Structures.Model.DeformingData.#ctor
Instantiates a deforming data instance.